import { PrismaClient } from '@prisma/client'

const prisma = new PrismaClient()

async function insertData() {
	try {
		await prisma.$executeRaw`

INSERT INTO t_hotel_room_photo (id, room_id, photo, alt) VALUES
(1, 1, '20140614145605.jpg', ''),
(2, 1, '20140614145619.jpg', ''),
(3, 63, '20140810010013.jpg', 'komil hotel twin bed room'),
(4, 63, '20140810010121.jpg', 'komil hotel double bed room'),
(5, 63, '20140810010237.jpg', 'bath room'),
(6, 64, '20140810010420.jpg', 'triple bed room , hotel komil'),
(7, 64, '20140810010453.jpg', 'triple bed room 16'),
(8, 64, '20140810010527.jpg', 'bath room 16'),
(9, 66, '20140810011850.jpg', 'sultan hotel twin bed'),
(10, 74, '20150106111353.jpg', 'Двухместный номер Majestic Palace'),
(11, 74, '20150106111442.jpg', 'Двухместный номер1 Majestic Palace2'),
(12, 70, '20150106115238.jpg', 'Royal room'),
(13, 68, '20150106115748.jpg', 'Двухместный номер '),
(14, 68, '20150106115909.jpg', 'Ванная комната'),
(15, 68, '20150106120037.jpg', 'Двух местный номер'),
(16, 76, '20150225101606.jpg', 'Afrosiyab Room'),
(17, 76, '20150225101709.jpg', 'Vannaya'),
(18, 76, '20150225101813.jpg', 'Room 5'),
(19, 77, '20150225102422.jpg', 'Room 1'),
(20, 77, '20150225102533.jpg', 'Bath room'),
(21, 77, '20150225102655.jpg', 'Room 3'),
(22, 77, '20150225103509.jpg', 'room 4'),
(23, 62, '20150314125919.jpg', 'One bed room'),
(24, 63, '20150314130128.jpg', 'Twin Bed room'),
(25, 57, '20150810134321.jpg', 'Twin Bed room'),
(26, 56, '20150810134413.jpg', 'odnomestnyi'),
(28, 58, '20150810134527.jpg', 'poluluks nomer'),
(29, 78, '20151228012928.jpg', 'platan-02-room'),
(30, 78, '20151228012946.jpg', 'Bathroom 1 '),
(31, 78, '20151228013003.jpg', 'Room 1'),
(32, 78, '20151228013115.jpg', 'Room 5'),
(33, 79, '20151228013623.jpg', 'Room 1'),
(34, 79, '20151228013641.jpg', 'Bathroom 1 '),
(35, 79, '20151228013702.jpg', 'room 4'),
(36, 88, '20170126072902.jpg', 'standard twin bed room'),
(39, 88, '20170126073155.jpg', 'Bathroom 1 '),
(40, 88, '20170126073336.jpg', 'twin room arba'),
(41, 88, '20170126073339.jpg', 'twin room arba'),
(42, 95, '20170209053514.png', 'Премиум'),
(43, 95, '20170209053619.png', 'Премиум'),
(45, 96, '20170209055448.jpg', 'Королевские аппартаменты'),
(46, 96, '20170209055840.jpg', 'Королевские аппартаменты'),
(47, 93, '20170209060336.jpg', 'Младший люкс'),
(48, 93, '20170209060413.jpg', 'Младший люкс'),
(49, 91, '20170209060757.png', 'Стандартный номер'),
(50, 94, '20170209061401.png', 'Старший люкс'),
(51, 94, '20170209061808.png', 'Ванная комната в \"Старшем люксе\"'),
(52, 92, '20170209062431.png', 'Улучшенный Стандартный Номер'),
(53, 92, '20170209062944.png', 'Улучшенный Стандартный Номер'),
(54, 92, '20170209063123.jpg', 'Ванная в улучшенном стандартном номере'),
(55, 99, '20170404063937.jpg', 'сингл'),
(56, 101, '20170404065301.jpg', 'дабл'),
(57, 100, '20170404065548.jpg', 'твин'),
(58, 102, '20170404065721.jpg', 'трипл'),
(59, 104, '20170816063103.jpg', 'Двухместный'),
(60, 228, 'photo_2022-03-25_16.15.51.jpg', 'Minorhotel'),
(61, 228, 'photo_2022-03-25_16.16.11.jpg', 'Minorhotel'),
(62, 228, 'photo_2022-03-25_16.16.23.jpg', 'Minorhotel'),
(63, 228, 'photo_2022-03-25_16.16.34.jpg', 'Minorhotel'),
(64, 230, 'photo_2022-03-25_16.16.04.jpg', 'Minorhotel'),
(65, 230, 'photo_2022-03-25_16.15.45.jpg', 'Minorhotel'),
(66, 230, 'photo_2022-03-25_16.16.341.jpg', 'Minorhotel'),
(67, 230, 'photo_2022-03-25_16.16.01.jpg', 'Minorhotel');

    `
		console.log('Данные успешно вставлены в базу данных')
	} catch (error) {
		console.error('Ошибка вставки данных:', error)
	} finally {
		await prisma.$disconnect()
	}
}

insertData()
